## 예제 8-8  query 함수와 메소드 처리하기

In [132]:
dfq1 = pd. DataFrame(np.random.randn(10, 2), columns=list('ab'))

In [133]:
dfq1

          a         b
0  0.637547  1.079870
1  0.607082 -1.337544
2 -0.141483  0.861973
3 -0.107978 -0.126069
4  0.648786  0.097370
5 -1.474407  0.580757
6  0.155076 -0.300015
7 -0.937716  1.419881
8  2.011545  1.257204
9  0.508536 -0.075223

In [134]:
dfq1.query('a < b')

          a         b
0  0.637547  1.079870
2 -0.141483  0.861973
5 -1.474407  0.580757
7 -0.937716  1.419881

In [48]:
try :
    dfq1.query('c = a < b',inplace=True)
except Exception as e :
    print('Exception :', e)

Exception : cannot assign without a target object

In [49]:
dfq1.query('a < b')

          a         b
0 -0.418235 -0.314954
1 -0.664736  1.790833
3 -0.590067  0.440108
4 -0.308907  0.361501
5 -0.060594  0.485510
6 -1.283406 -0.287438
7 -0.609238 -0.187161
8 -1.209837  0.653762
9 -2.465995 -0.437341

In [50]:
dfq1[dfq1.a < dfq1.b]

          a         b
0 -0.418235 -0.314954
1 -0.664736  1.790833
3 -0.590067  0.440108
4 -0.308907  0.361501
5 -0.060594  0.485510
6 -1.283406 -0.287438
7 -0.609238 -0.187161
8 -1.209837  0.653762
9 -2.465995 -0.437341

In [51]:
df_q2 = dfq1.query('a < b')

In [52]:
df_q2

          a         b
0 -0.418235 -0.314954
1 -0.664736  1.790833
3 -0.590067  0.440108
4 -0.308907  0.361501
5 -0.060594  0.485510
6 -1.283406 -0.287438
7 -0.609238 -0.187161
8 -1.209837  0.653762
9 -2.465995 -0.437341

In [53]:
df = pd. DataFrame(np.random.randn(10, 2), columns=list('가나'))

In [54]:
result1 = df[(df.가 < 0.5) & (df.나 < 0.5)]

In [55]:
result2 = pd.eval('df[(df.가 < 0.5) & (df.나 < 0.5)]')

In [56]:
np.allclose(result1, result2)

True

In [57]:
result3 = df.query('가 < 0.5 and 나 < 0.5')

In [58]:
np.allclose(result1, result3)

True

In [59]:
Bmean = df['나'].mean()

In [60]:
Bmean

-0.8589039533148775

In [61]:
(df.가 < Bmean) & (df.나 < Bmean)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [62]:
result11 = df[(df.가 < Bmean) & (df.나 < Bmean)]

In [63]:
result11.shape

(0, 2)

In [64]:
result11

Empty DataFrame
Columns: [가, 나]
Index: []

In [65]:
result12 = df.query("(가 < @Bmean) & (나 < @Bmean)")

In [66]:
result12.shape

(0, 2)

In [67]:
result12

Empty DataFrame
Columns: [가, 나]
Index: []

In [68]:
np.allclose(result11, result12)

True

In [69]:
a = list('가나다라마바')

In [70]:
b = range(6)

In [71]:
df_ = pd.DataFrame({'X':pd.Series(a),'Y': pd.Series(b)})

In [72]:
df_

   X  Y
0  가  0
1  나  1
2  다  2
3  라  3
4  마  4
5  바  5

In [73]:
df_Y = df_.query('Y < 3')

In [74]:
df_Y

   X  Y
0  가  0
1  나  1
2  다  2

In [75]:
import numexpr as ne

In [76]:
ne_works = ne.evaluate('"가" < "라"')

In [77]:
ne_works

array(True)

In [78]:
df_.X < '라'

0     True
1     True
2     True
3    False
4    False
5    False
Name: X, dtype: bool

In [79]:
df_X = df_.query('X < "라"')

In [80]:
df_X

   X  Y
0  가  0
1  나  1
2  다  2